export const regex = {
    // 全数字
    number: /^[0-9]*$/,
    // 商户号
    merchantNo: /^[0-9]{15}$/,
    // 多个终端号
    termId: /^[0-9,]*$/,
    // 手机号码
    cellphone: /^1\d{10}$/,
    // 联系电话 座机 手机
    contact: /^\d{3,4}-?\d{7,8}$/,
    // 短信验证码
    verifyCode: /^[0-9]{6}$/,
    // 邮箱
    email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z]{2,4}$/,
    // 邮箱前缀
    emailPrefix: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*$/,
    // password: /(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[^a-zA-Z0-9]).{8,32}/,
    // 大小写 数字 特殊字符  四选三
    password: /^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z\W_]+$)(?![a-z0-9]+$)(?![a-z\W_]+$)(?![0-9\W_]+$)[a-zA-Z0-9\W_]{8,16}$/,
    // 多个设备序列号
    batchSn: /^([a-zA-Z0-9]+,)*[a-zA-Z0-9]+$/,
    // 自定义标签
    tag: /^\S*$/,
    // 优先级
    priority: /^[123456789][0-9]?$/,
    url: /^((ht|f)tps?):\/\/[\w\-]+(\.[\w\-]+)+([\w\-\.,@?^=%&:\/~\+#]*[\w\-\@?^=%&\/~\+#])?$/,
    // 图片名称
    imgname: /^\S{1,32}$/
}
